
#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьСообщениеВТелеграм(ТекстСообщения) Экспорт
	
	Токен = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	ЧатИдентификатор = Константы.ВКМ_ИдентификаторГруппыДляОповещания.Получить();
	
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
	Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , ЗащищенноеСоединение);
	
	//Ресурс = СтрШаблон("bot%1/sendMessage", Токен);
	Ресурс = "bot"+Токен+"/sendMessage?chat_id="+ЧатИдентификатор+"&text="+ТекстСообщения;
	
//	ПараметрыЗапроса = Новый Структура;
//	ПараметрыЗапроса.Вставить("chat_id", ЧатИдентификатор);
//	ПараметрыЗапроса.Вставить("text", ТекстСообщения);
//	
//	ЗаписьJSON = Новый ЗаписьJSON;
//	ЗаписьJSON.УстановитьСтроку();
//	ЗаписатьJSON(ЗаписьJSON, ПараметрыЗапроса);
//	ТелоЗапроса = ЗаписьJSON.Закрыть();
	
	Запрос = Новый HTTPЗапрос(Ресурс);
	
	Запрос.Заголовки.Вставить("Content-Type","application/json" );
	
//	Запрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8);
	
	HTTPОтвет = Соединение.Получить(Запрос);
	
	Если HTTPОтвет.КодСостояния <> 200 Тогда
		
		ТекстОшибки = HTTPОтвет.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			
			ЗаписьЖурналаРегистрации("Телеграм.ОшибкиОтправленияСообщения", УровеньЖурналаРегистрации.Ошибка, , ,
									СтрШаблон("Ошибка отправки сообщения. Код состояния: %1. Ответ сервера: %2", 
									HTTPОтвет.КодСостояния, ТекстОшибки));
	КонецЕсли;				
		
	
КонецПроцедуры

Процедура ОтправитьУведомлениеВТелеграм () Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка,
		|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ОтправитьСообщениеВТелеграм(ВыборкаДетальныеЗаписи.ТекстСообщения);
		
		ОбъектУведомления = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		Если ОбъектУведомления <> Неопределено Тогда
			ОбъектУведомления.Удалить();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти