#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПроверитьПревышениеОтпуска();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПроверитьПревышениеОтпуска();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ДатаНачала) И ЗначениеЗаполнено(ТекущиеДанные.ДатаОкончания) Тогда
		ПроверитьПревышениеОтпускаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ДатаНачала) И ЗначениеЗаполнено(ТекущиеДанные.ДатаОкончания) Тогда
		ПроверитьПревышениеОтпускаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура АнализГрафика(Команда)
	
	Адрес = ПоместитьВоВременноеХранилищеСервер();
	ПараметрыФормы = Новый Структура("Адрес", Адрес);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, Элементы.ОтпускаСотрудников);
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьПревышениеОтпускаНаСервере()
	
	ПроверитьПревышениеОтпуска();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьПревышениеОтпуска()
	
	Превышение = ПолучитьСотрудниковСпревышением();
	
	Если Превышение.Количество() > 0 Тогда 
		ПодсветитьСтроки(Превышение);
	Иначе
		УсловноеОформление.Элементы.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСотрудниковСпревышением()
	
	Превышение = Новый Массив;
	
	Сотрудники = Объект.ОтпускаСотрудников.Выгрузить();
	Сотрудники.Колонки.Добавить("СуммаДней", Новый ОписаниеТипов("Число"));
	
	Для Каждого Строка Из Сотрудники Цикл
		ДлительностьОтпуска = Строка.ДатаОкончания - Строка.ДатаНачала;
		Строка.СуммаДней = ДлительностьОтпуска / 86400 + 1;
	КонецЦикла;
	
	Сотрудники.Свернуть("Сотрудник", "СуммаДней");
	
	Для Каждого Строка Из Сотрудники Цикл
		Если Строка.СуммаДней > 28 Тогда
			Превышение.Добавить(Строка.Сотрудник);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Превышение;
	
КонецФункции

&НаСервере
Процедура ПодсветитьСтроки(МассивСотрудников)

	УсловноеОформление.Элементы.Очистить();
	
	Для Каждого ТекущийСотрудник Из МассивСотрудников Цикл
		
		ЭлементОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементОформления.Использование = Истина;
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 215, 0));
		
		ЭлементУсловия = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.Сотрудник"); 
		ЭлементУсловия.ПравоеЗначение = ТекущийСотрудник; 
		ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		ЭлементУсловия.Использование = Истина; 
		
		ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить(); 
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковСотрудник");
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьВоВременноеХранилищеСервер() 
	
	ТаблицаЗначений = Объект.ОтпускаСотрудников.Выгрузить(); 
	Адрес = ПоместитьВоВременноеХранилище(ТаблицаЗначений);
	
	Возврат Адрес;

КонецФункции

#КонецОбласти