#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СоздатьСписокНаСервере (ДатаНачала, ДатаОкончания) Экспорт
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Реализация
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
		|	ДоговорыКонтрагентов.Организация КАК Организация,
		|	ВТ_Реализация.Ссылка КАК Реализация,
		|	&ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	ВТ_Реализация КАК ВТ_Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО ДоговорыКонтрагентов.Ссылка = ВТ_Реализация.Ссылка.Договор
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		|	И ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора <= &ДатаНачала
		|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора >= &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Список = СформироватьСписокРеализации(Выборка);
	
	Возврат Список;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецФункции

Функция СформироватьСписокРеализации(Выборка)
	
	СписокРеализаций = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		СписокРеализацийСтруктура = Новый Структура; 
		
			Если Не ЗначениеЗаполнено(Выборка.Реализация) Тогда 
				НоваяРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент(); 
	            НоваяРеализация.Дата = Выборка.ДатаОкончания;
				НоваяРеализация.Ответственный = Пользователи.ТекущийПользователь(); 
				НоваяРеализация.Договор = Выборка.Договор;    
		        НоваяРеализация.Контрагент = Выборка.Владелец; 
		        НоваяРеализация.Организация = Выборка.Организация; 
				НоваяРеализация.ВКМ_ВыполнитьАвтозаполнение(); 
					Если НоваяРеализация.ПроверитьЗаполнение() Тогда 
						НоваяРеализация.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный); 
					КонецЕсли; 
				СписокРеализацийСтруктура.Вставить("Договор", Выборка.Договор); 
				СписокРеализацийСтруктура.Вставить("Реализация", НоваяРеализация.Ссылка);
        	Иначе 
				СписокРеализацийСтруктура.Вставить("Договор", Выборка.Договор); 
				СписокРеализацийСтруктура.Вставить("Реализация", Выборка.Реализация);	
			КонецЕсли; 
		
		СписокРеализаций.Добавить(СписокРеализацийСтруктура); 
	
	КонецЦикла; 
	
	Возврат СписокРеализаций;
КонецФункции

#КонецОбласти

#КонецЕсли
