
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СоздатьСписокНаСервере(ДатаНачала, ДатаОкончания) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслуг.Договор КАК Договор
		|ПОМЕСТИТЬ ВТ_Реализация
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
		|	ДоговорыКонтрагентов.Организация КАК Организация,
		|	ВТ_Реализация.Ссылка КАК Реализация,
		|	&ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реализация КАК ВТ_Реализация
		|		ПО ДоговорыКонтрагентов.Ссылка = ВТ_Реализация.Договор
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		|	И ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора <= &ДатаОкончания
		|	И (ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора >= &ДатаНачала 
		|		ИЛИ ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора = ДАТАВРЕМЯ(1,1,1))"; 
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат СформироватьСписокРеализации(Выборка);
	
КонецФункции

Функция СформироватьСписокРеализации(Выборка)
	
	СписокРеализаций = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		СписокРеализацийСтруктура = Новый Структура; 
		
		Если Не ЗначениеЗаполнено(Выборка.Реализация) Тогда 
		
			НоваяРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент(); 
			НоваяРеализация.Дата = Выборка.ДатаОкончания;
			НоваяРеализация.Договор = Выборка.Договор;    
			НоваяРеализация.Контрагент = Выборка.Контрагент; 
			НоваяРеализация.Организация = Выборка.Организация; 
			
			НоваяРеализация.ВКМ_ВыполнитьАвтозаполнение(); 
			
			Если НоваяРеализация.ПроверитьЗаполнение() Тогда 
				НоваяРеализация.Записать(РежимЗаписиДокумента.Проведение); 
			Иначе
				НоваяРеализация.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли; 
			
			СписокРеализацийСтруктура.Вставить("Договор", Выборка.Договор); 
			СписокРеализацийСтруктура.Вставить("Реализация", НоваяРеализация.Ссылка);
		Иначе 
			СписокРеализацийСтруктура.Вставить("Договор", Выборка.Договор); 
			СписокРеализацийСтруктура.Вставить("Реализация", Выборка.Реализация);	
		КонецЕсли; 
		
		СписокРеализаций.Добавить(СписокРеализацийСтруктура); 
	
	КонецЦикла; 
	
	Возврат СписокРеализаций;
КонецФункции

#КонецОбласти

#КонецЕсли
