
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	НужноСоздатьУведомление = Ложь;
	ТекстСообщения = "";
	
	Если ЭтоНовый() Тогда
		НужноСоздатьУведомление = Истина;
		ТекстСообщения = ТекстСообщения + СтрШаблон("Появилась новая заявка! Специалист: %1. Дата: %2. Время: %3.", ВКМ_Специалист, Формат(ВКМ_ДатаПроведенияРабот, "ДЛФ=D"), Формат(ВКМ_ВремяНачалаРаботПлан, "ДЛФ=В;"));
	Иначе
		СсылкаНаОбъект = ЭтотОбъект.Ссылка;
		СтарыеДанные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, "ВКМ_Специалист, ВКМ_ДатаПроведенияРабот, ВКМ_ВремяНачалаРаботПлан");
		
		Если СтарыеДанные.ВКМ_Специалист <> ВКМ_Специалист 
			Или СтарыеДанные.ВКМ_ДатаПроведенияРабот <> ВКМ_ДатаПроведенияРабот 
			Или СтарыеДанные.ВКМ_ВремяНачалаРаботПлан <> ВКМ_ВремяНачалаРаботПлан Тогда
			
			НужноСоздатьУведомление = Истина;
			ТекстСообщения = ТекстСообщения + СтрШаблон("Изменились параметры заявки! Cпециалист: %1. Дата: %2. Время: %3.", Формат(ВКМ_ДатаПроведенияРабот, "ДЛФ=D"), Формат(ВКМ_ВремяНачалаРаботПлан, "ДЛФ=В;"));
		КонецЕсли;
	КонецЕсли;
	
	Если НужноСоздатьУведомление Тогда
		
		НовоеУведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		НовоеУведомление.ТекстСообщения = ТекстСообщения;
		НовоеУведомление.Записать();
		
	КонецЕсли;
	
//	ВКМ_Телеграм.ОтправитьУведомлениеВТелеграм();
	
КонецПроцедуры
	

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Не ЗначениеЗаполнено(ВКМ_Договор) Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Не указан договор!");
		Возврат;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора КАК ДатаНачалаДействияДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора КАК ДатаОкончанияДействияДоговора,
		|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВКМ_Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если Не ВыборкаДетальныеЗаписи.Следующий() Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Договор не найден");
		Возврат;
	КонецЕсли;
	
	Если ВыборкаДетальныеЗаписи.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Нужно выбрать вид договора : Абонентское обслуживание");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаНачалаДействияДоговора) 
		Или Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаОкончанияДействияДоговора) Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("В договоре не указаны дата начала или дата окончания");
			Возврат;
	КонецЕсли;
	
	ДатаДокумента = Дата;
	
	Если ДатаДокумента < ВыборкаДетальныеЗаписи.ДатаНачалаДействияДоговора 
		Или ДатаДокумента > ВыборкаДетальныеЗаписи.ДатаОкончанияДействияДоговора Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Дата документа выходит за пределы действия договора");
			Возврат;
	КонецЕсли;
	
	СтавкаЧас = ВыборкаДетальныеЗаписи.СтоимостьЧасаРаботы;
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Для Каждого СтрокаТЧ Из ВКМ_ВыполненныеРаботы Цикл
		
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВКМ_Клиент = ВКМ_Клиент;
		Движение.ВКМ_Договор = ВКМ_Договор;
		Движение.ВКМ_КоличествоЧасов = СтрокаТЧ.ВКМ_ЧасыКОплатеКлиенту;
		Движение.ВКМ_СуммаКОплате = СтрокаТЧ.ВКМ_ЧасыКОплатеКлиенту * СтавкаЧас;
		
	КонецЦикла;
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();
	
	ВыполненныеСотрудникомРаботы(Отказ);
	
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполненныеСотрудникомРаботы(Отказ)
	
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Сотрудник.Ссылка = &Сотрудник) КАК
		|		ВКМ_УсловияОплатыСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Сотрудник", ВКМ_Специалист);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Для данного специалиста не установлен процент оплаты от работ!");
		Возврат;
	КонецЕсли;
	
	ЧасыКОплате = ВКМ_ВыполненныеРаботы.Итог("ВКМ_ЧасыКОплатеКлиенту");
	СтавкаЧаса = ВКМ_Договор.ВКМ_СтоимостьЧасаРаботы;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ВКМ_Специалист;
		Движение.ЧасовКОплате = ЧасыКОплате;
		
		ПроцентОтРабот = ВыборкаДетальныеЗаписи.ПроцентОтРабот;
		
		Движение.СуммаКОплате = ЧасыКОплате * СтавкаЧаса * ПроцентОтРабот / 100;
		
		Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записать();
		
	КонецЦикла;
	

КонецПроцедуры


#КонецОбласти

#КонецЕсли
	