#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Адрес = Параметры.Адрес;
	
	Если Не ЗначениеЗаполнено(Адрес) Тогда
		Возврат;
	КонецЕсли;
	
	ГрафикОтпусков = ПолучитьИзВременногоХранилища(Адрес);
	
	АнализГрафикаОтпусков.Обновление = Истина;
	АнализГрафикаОтпусков.Очистить();
	
	Для Каждого Строка Из ГрафикОтпусков Цикл
		
		Точка = АнализГрафикаОтпусков.УстановитьТочку(Строка.Сотрудник);
		Серия = АнализГрафикаОтпусков.УстановитьСерию("Отпуск");
		Значение = АнализГрафикаОтпусков.ПолучитьЗначение(Точка, Серия );
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
		
	КонецЦикла;
	
	АнализГрафикаОтпусков.Обновление = Ложь;
	
КонецПроцедуры

#КонецОбласти