
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда  
    
#Область ОбработчикиСобытий


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл
		Если ЗначениеЗаполнено(Строка.ДатаНачала) И ЗначениеЗаполнено(Строка.ДатаОкончания) Тогда
			Строка.ДлительностьОтпуска = РазницаВДнях(Строка.ДатаНачала, Строка.ДатаОкончания);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
    
    Для каждого Строка Из ОтпускаСотрудников Цикл   
        
        Если НЕ ЗначениеЗаполнено(Строка.ДатаНачала) ИЛИ НЕ ЗначениеЗаполнено(Строка.ДатаОкончания) ИЛИ Строка.ДатаНачала >= Строка.ДатаОкончания Тогда
            ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Неверно заполнен период в строке №%1", Строка.НомерСтроки)); 
            Отказ = Истина;  
        КонецЕсли; 
    КонецЦикла;
    
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВКМ_ОтпускСотрудников.Записывать = Истина;
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл
	
		Движение = Движения.ВКМ_ОтпускСотрудников.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Год = Год;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.КоличествоДней = Строка.ДлительностьОтпуска;
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РазницаВДнях(ДатаНачала, ДатаОкончания)

	Если ДатаОкончания < ДатаНачала Тогда
		Возврат 0;
	КонецЕсли;
	Возврат Цел((ДатаОкончания - ДатаНачала) / 86400) + 1;
	
КонецФункции


#КонецОбласти
#КонецЕсли