
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВКМ_ИзменениеВидимостиРеквизитовАбонентскойПлаты();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВКМ_ИзменениеВидимостиРеквизитовАбонентскойПлаты();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ИзменениеВидимостиРеквизитовАбонентскойПлаты()
	
	Вид = Объект.ВидДоговора;
	
	Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = (Вид = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = (Вид = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = (Вид = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = (Вид = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание); 
	
КонецПроцедуры

#КонецОбласти
 