
&НаСервере
Функция ЗаполнитьНаСервере()
	
	ДатаНачала = Объект.ВКМ_Период.ДатаНачала;
	ДатаОкончания = Объект.ВКМ_Период.ДатаОкончания;
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,"Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьСписокНаСервере", ДатаНачала, ДатаОкончания);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура Заполнить(Команда)
	
	ДлительнаяОперация = ЗаполнитьНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнитьТаблицу", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицу(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
    
    	Возврат; 
    
    КонецЕсли;   
    
    СписокРеализаций = ПолучитьИзВременногоХранилища(Результат.АдресРезультата); 
    
    УдалитьИзВременногоХранилища(Результат.АдресРезультата);  
   
   ЗаполнитьСписокРеализаций(СписокРеализаций);
   
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокРеализаций(СписокРеализаций)
    
     Объект.ВКМ_ТЧ_ДоговорРеализация.Очистить();
     
     Для каждого Строка Из СписокРеализаций Цикл
     
     	 НоваяСтрока = Объект.ВКМ_ТЧ_ДоговорРеализация.Добавить(); 
         НоваяСтрока.Договор = Строка.Договор; 
         НоваяСтрока.Реализация = Строка.Реализация; 
     
     КонецЦикла;
    

КонецПроцедуры
